Tekla Open API Reference for Tekla Structures 2025
Vector.GetLength Method
 Gets the length (magnitude) of a vector.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double GetLength()
Public Function GetLength As Double
Return Value
Type: Double
The vector's length.
See Also
Reference
Vector Class
Tekla.Structures.Geometry3d Namespace